:PROPERTIES:
:ID: 67362277-05E4-4FA6-8420-51C97236DF61
:END:
#+title: Basic connect
#+description: Basic connect
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:accounts:
#+created: 2026-05-21
#+updated: 2026-05-21

#+name: basic-connect
#+begin_src ores-shell :exports none
connect localhost 51004 test
exit
#+end_src

#+begin_src sh :noweb yes :results output :wrap example
./ores.shell ${log_args} << 'EOF'
<<basic-connect>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
ORE Studio Shell REPL v0.0.12
Type 'help' for available commands, 'exit' to quit.

ores-shell> ✓ Connected to :51004
ores-shell> Bye!
#+end_example
